app/views/drinks/index.html.erb

    <p><%= link_to "#{drink.name}", drink_path(drink)%>
        <p><%= drink.votes_for.size %> <%=
            (drink.votes_for.size) == 1 ? 'Like' : 'Likes' %></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."drink_id" = ?  [["drink_id", 61]]