app/views/drinks/show.html.erb


<% Drink.all.each do |drink| %>
---
SELECT "drinks".* FROM "drinks"