app/views/drinks/show.html.erb


<p><%= @drink.likes.count %>
<%= (@drink.likes.count) == 1 ? 'Like' : 'Likes' %></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."drink_id" = ?  [["drink_id", 18]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."drink_id" = ?  [["drink_id", 61]]