app/views/users/show.html.erb

SELECT "user_drinks".* FROM "user_drinks"
---

  <% if @user.my_drinks.empty? %>

SELECT "drinks".* FROM "drinks"
---
    <% end %>
  <p><%= link_to Drink.all.sample.name, drink_path%></p>