app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 84], ["LIMIT", 1]]
---
def set_user
@current_user = User.find_by(id: session[:user_id])