app/controllers/carts_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 159], ["LIMIT", 1]]
---
    def add_item
        p = Product.find(params[:id])