app/controllers/drinks_controller.rb

SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 69], ["LIMIT", 1]]
---
    def show
    @drink = Drink.find(params[:id])

SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def upvote
    @drink = Drink.find(params[:id])

SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 69], ["LIMIT", 1]]
---
    def downvote
        @drink = Drink.find(params[:id])

SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def find_drink
        @drink = Drink.find(params[:id])