app/controllers/likes_controller.rb

def find_drink
@drink = Drink.find(params[:drink_id])
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 61], ["LIMIT", 1]]