app/controllers/products_controller.rb

    def add_to_cart
        @shoppingcart = ShoppingCart.create
        @product = Product.find(params[:id])
---
INSERT INTO "shopping_carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-05-07 18:41:31.586835"], ["updated_at", "2020-05-07 18:41:31.586835"]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 141], ["LIMIT", 1]]