app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "age", "reason_for_visiting", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)