app/models/user.rb

    def my_drinks
    @mine = UserDrink.where(user_id: self.id)
    @mine.all.each do |userdrink|
---
SELECT "user_drinks".* FROM "user_drinks" WHERE "user_drinks"."user_id" = ?  [["user_id", 85]]
SELECT "user_drinks".* FROM "user_drinks" WHERE "user_drinks"."user_id" = ?  [["user_id", 80]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def my_cart
      #  mycart = UserProduct.where(user_id: self)
      #  mycart.products.name
      @myproducts = UserProduct.where(user_id: self.id)
      @myproducts.all.each do |userproduct|
---
SELECT "user_products".* FROM "user_products" WHERE "user_products"."user_id" = ?  [["user_id", 23]]
SELECT "user_products".* FROM "user_products" WHERE "user_products"."user_id" = ?  [["user_id", 80]]